/*#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

void main()
{
	/*int i, k;

	for (i = 0; i < 3; i++)
	{
		for (k = 0; k < 2;k++)
		{
			printf("중첩 for문입니다. (i값: %d, k값: %d)\n", i, k);

		}
	}
	------------------------------------------------------------------------------------------
	*/

	/*int i, k;

	for (i = 2; i <= 9; i++)
	{
		for (k = 1; k <= 9; k++)
		{
			printf("%d X %d = %d \t", i, k, i * k);

		}
		printf("\n");
	}
	------------------------------------------------------------------------------------------
	*/

	/*int i, k;

	for (i = 2, k = 1; i<= 9; i++, k++)
		printf("%d X %d = %d \n", i, k, i * k);
	------------------------------------------------------------------------------------------
	*/
	/*
	int i;
	i = 0;
	for (;;)
	{
		printf("%d \n", i);
		i++;

	}*/
	/*
	int a, b;

	for (;;)
	{
		printf("더할 두 수 입력 (멈추려면 Ctrl + C) :");
		scanf("%d %d", &a, &b);

		printf("%d + %d = %d \n", a, b, a + b);

	}
	*/



//}*/