#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

void main()
{
	/*int i, no;

	for (i = 0, no=1;i < 20000 ; i *=2, printf("%d번 실행 : 안녕하세요? 빙글빙글 for 문을 공부 중입니다. ^^\n",no),no++);
	*/

	/*-------------------------------------------------------------------------------------*/

	/*
	int i;
	for (i = 0; i < 3; i++)
	{
		printf("안녕하세요? \n");
		printf("##또 안녕하세요?##\n");
	}

	printf("\n\n");

	for (i = 0; i < 3; i++)
		printf("안녕하세요? \n");
	printf("##또 안녕하세요?## \n");

	*/

	/*-------------------------------------------------------------------------------------*/
	/*
	int i, hap =0;

	for (i = 0; i <= 10; hap += i, i++); // hap += i, i++ 신경쓰자
	printf("%d", hap);
	*/
	/*-------------------------------------------------------------------------------------*/
	/*
	int hap = 0;
	int i;

	for (i = 501;i <= 1000; hap += i, i += 2)
	{ }

	printf("500에서 1000까지의 홀수의 합 : %d \n", hap);
	*/
	/*-------------------------------------------------------------------------------------*/
	/*
	int hap = 0;
	int i, num;

	printf("값 입력 :");
	scanf("%d", &num);

	for(i=1; i <= num; hap += i , i++)
	{ }

	printf("1에서 %d까지의 합 : %d \n", num, hap);
	*/
	/*-------------------------------------------------------------------------------------*/
	/*
	int hap = 0;
	int i;
	int num1, num2, num3;


	printf("시작값, 끊값, 증가값 입력 : ");
	scanf("%d %d %d", &num1, &num2, &num3);

	for (i = num1 ; i <= num2; i = i+ num3 )
	{ 
		hap = hap+i; 
	}

	printf("%d에서 %d까지 %d씩 증가한 값의 합 : %d \n", num1, num2, num3, hap);

	*/
	/*-------------------------------------------------------------------------------------*/
	/*
	int i;
	int dan;

	printf("몇 단? ");

	scanf("%d", &dan);

	for (i = 1; i <= 9; i++)
	{
		printf("%d X %d = %d \n", dan, i, dan * i);
	}
	*/




}
