/*#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

void main()
{
	/*int a = 200;

	if (a < 100)

		printf("100보다 작군요..\n");

	else

		printf("100보다 크군요..\n");*/
	/*-------------------------------------------------------------------------------------*/
	/*int a = 200;

	if (a < 100)
	{
		printf("100보다 작군요..\n");
		printf("참이면 이 문장도 보이겠죠?\n");

	}
	else
	{
		printf("100보다 크군요..\n");
		printf("거짓이면 이 문장도 보이겠죠?\n");
	}

	printf("프로그램 끝! \n");*/
	/*-------------------------------------------------------------------------------------*/
	/*int a;

	printf("정수를 입력하세요 : ");
	scanf("%d", &a);

	if (a % 2 == 0)
	{
		printf("짝수를 입력했군요..\n");
	}
	else
	{
		printf("홀수를 입력했군요..\n");
	}*/
	/*-------------------------------------------------------------------------------------*/
	//int a = 75;

	/*if (a > 50)
	{
		if (a < 100) //(a>50 && a<100)
		{
			printf("50보다 크고 100보다 작군요..\n");
		}
		else
		{
			printf("와~~ 100보다 크군요..\n");
		}
	}

}*/